app/controllers/api/v1/booking_processes_controller.rb

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
---
            def price
                @price = 0.0

                @height = params[:height]
                @width = params[:width]

                @space = Space.find(params[:idSpace])

SELECT `booking_processes`.* FROM `booking_processes`
---
            def index
                @booking_processes = BookingProcess.all

SELECT  `lessees`.* FROM `lessees` WHERE `lessees`.`id` = 1 LIMIT 1
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1
INSERT INTO `booking_processes` (`lessee_id`, `space_id`, `document_id`, `step`, `start_date`, `end_date`, `monthly_fee`, `created_at`, `updated_at`) VALUES (1, 1, 1, 0, '2019-10-18 00:00:00', '2019-11-17 00:00:00', 200, '2019-10-18 13:41:05', '2019-10-18 13:41:05')
---
            def create
                @lessee = Lessee.find(params[:lessee][:id])
                @space = Space.find(params[:space][:id])
                @document = Document.find(params[:document][:id])

                @booking_process = BookingProcess.new(
                    lessee_id: @lessee.id,
                    space_id: @space.id,
                    document_id: @document.id,
                    step: params[:step],
                    start_date: params[:start_date],
                    end_date: params[:end_date],
                    monthly_fee: params[:monthly_fee],
                    periodicity: params[periodicity]
                    )

                if @booking_process.save

SELECT  `lessees`.* FROM `lessees` WHERE `lessees`.`id` = 1 LIMIT 1
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1
SELECT  `booking_processes`.* FROM `booking_processes` WHERE `booking_processes`.`id` = 1 LIMIT 1
UPDATE `booking_processes` SET `step` = 2, `updated_at` = '2019-10-18 13:56:38' WHERE `booking_processes`.`id` = 1
---
            def update
                @lessee = Lessee.find(params[:lessee][:id])
                @space = Space.find(params[:space][:id])
                @document = Document.find(params[:document][:id])

                @booking_process=BookingProcess.find(params[:id])
                if @booking_process.update(
                    lessee_id: @lessee.id,
                    space_id: @space.id,
                    document_id: @document.id,
                    step: params[:step],
                    start_date: params[:start_date],
                    end_date: params[:end_date],
                    monthly_fee: params[:monthly_fee],
                    periodicity: params[periodicity]
                )