app/controllers/api/v1/booking_processes_controller.rb

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
---
            def create
                @lessor = Lessor.find(params[:lessor][:id])

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
---
            def update
                @lessor = Lessor.find(params[:lessor][:id])