app/controllers/api/v1/booking_processes_controller.rb

SELECT `booking_processes`.* FROM `booking_processes` WHERE `booking_processes`.`step` = 0 AND `booking_processes`.`lessee_id` = 1 ORDER BY `booking_processes`.`id` DESC
---
            def lessees
                @booking_processes = BookingProcess.all.order(id: :desc).where(step: 0).where(lessee_id: params[:lesseeId])

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
---
            def lessors
                @bookingProcesses = Array.new
                @spacesFromLessor = Lessor.find(params[:lessorId]).spaces
                @spacesFromLessor.each do |space|

SELECT  `lessees`.* FROM `lessees` WHERE `lessees`.`id` = 1 LIMIT 1
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
INSERT INTO `booking_processes` (`lessee_id`, `space_id`, `document_id`, `step`, `start_date`, `end_date`, `monthly_fee`, `created_at`, `updated_at`) VALUES (1, 1, 1, 0, '2019-10-18 00:00:00', '2019-11-17 00:00:00', 200, '2019-10-18 13:41:05', '2019-10-18 13:41:05')
---
            def intention
                @lessee = Lessee.find(params[:lessee][:id])
                @space = Space.find(params[:space][:id])

                @booking_process = BookingProcess.new(
                    lessee_id: @lessee.id,
                    space_id: @space.id,
                    document_id: 1,
                    step: 0,
                    start_date: params[:start_date],
                    end_date: params[:end_date],
                    monthly_fee: params[:monthly_fee],
                    periodicity: params[:periodicity],
                    width: params[:width],
                    height: params[:height]
                )

                if @booking_process.save

SELECT  `booking_processes`.* FROM `booking_processes` WHERE `booking_processes`.`id` = 1 LIMIT 1
---
            def aprove
                @booking_process=BookingProcess.find(params[:id])

SELECT  `booking_processes`.* FROM `booking_processes` WHERE `booking_processes`.`id` = 1 LIMIT 1
UPDATE `booking_processes` SET `step` = 2, `updated_at` = '2019-10-18 13:56:38' WHERE `booking_processes`.`id` = 1
---
            def deny
                @booking_process=BookingProcess.find(params[:id])
                if @booking_process.update(
                    step: 2
                )