app/controllers/api/v1/documents_controller.rb

SELECT `documents`.* FROM `documents`
---
            def index
                @documents = Document.all

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 8 LIMIT 1
---
            def show
                @document = Document.find(params[:id])

SELECT  `document_types`.* FROM `document_types` WHERE `document_types`.`id` = 1 LIMIT 1
INSERT INTO `documents` (`document_type_id`, `url_document`, `created_at`, `updated_at`) VALUES (1, 'www.youtube.com', '2019-09-11 00:15:25', '2019-09-11 00:15:25')
---
            def create

                @documentType = DocumentType.find(params[:document_type][:id])

                @document = Document.new(document_type_id: @documentType.id, url_document: params[:url_document])

                if @document.save

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 8 LIMIT 1
---
            def destroy
                @document = Document.find(params[:id])