app/controllers/api/v1/document_types_controller.rb

SELECT `document_types`.* FROM `document_types`
---
      def index
          @document_types = DocumentType.all

SELECT  `document_types`.* FROM `document_types` WHERE `document_types`.`id` = 1 LIMIT 1
---
      def show
        @document_type = DocumentType.find(params[:id])

INSERT INTO `document_types` (`name`, `description`, `created_at`, `updated_at`) VALUES ('hola', 'descripción', '2019-09-16 23:10:25', '2019-09-16 23:10:25')
---
      def create
        @document_type = DocumentType.new(document_type_params)

        if @document_type.save