app/controllers/api/v1/lessors_controller.rb

            def index
                @lessors = Lessor.all
---
SELECT `lessors`.* FROM `lessors`

            def show
                @lessor = Lessor.find(params[:id])
---
SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1

            def create
                @user = User.find(params[:user][:id])

                @lessor = Lessor.new(user_id: @user.id, ruc: params[:ruc], commercial_name: params[:commercial_name], first_name: params[:first_name], last_name: params[:last_name], doc_type: params[:doc_type], doc_number: params[:doc_number], phone: params[:phone], email: params[:email])
                if @lessor.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `lessors` (`user_id`, `ruc`, `commercial_name`, `first_name`, `last_name`, `doc_type`, `doc_number`, `phone`, `email`, `created_at`, `updated_at`) VALUES (2, '10716532521', 'Marcelo S.A.', 'Marcelo', 'Rios', 0, '71653252', '956868516', 'marcesftwr2@gmail.com', '2019-09-16 22:35:28', '2019-09-16 22:35:28')

            def spaces
                @lessor = Lessor.find(params[:id])
---
SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1

            def username
                @user = User.find(params[:userId])

                @lessor = Lessor.where(user_id: @user.id)

                render json: @lessor.first, status: :ok
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`user_id` = 1 ORDER BY `lessors`.`id` ASC LIMIT 1