app/controllers/api/v1/lessees_controller.rb

SELECT `lessees`.* FROM `lessees`
---
            def index
                @lessees = Lessee.all

SELECT  `lessees`.* FROM `lessees` WHERE `lessees`.`id` = 2 LIMIT 1
---
            def show
                @lessee = Lessee.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `lessees` (`user_id`, `first_name`, `last_name`, `doc_type`, `phone`, `email`, `created_at`, `updated_at`) VALUES (1, '0', '10', 20, '200', 'marcesftwr2@gmail.com', '2019-09-16 22:54:50', '2019-09-16 22:54:50')
---
            def create
                @user = User.find(params[:user][:id])

                @lessee = Lessee.new(user_id: @user.id, ruc: params[:ruc], commercial_name: params[:commercial_name], first_name: params[:first_name], last_name: params[:last_name], doc_type: params[:doc_type], doc_number: params[:doc_number], phone: params[:phone], email: params[:email])
                if @lessee.save