app/controllers/api/v1/locations_controller.rb

SELECT `locations`.* FROM `locations`
---
            def index
                @locations = Location.all

SELECT  `locations`.* FROM `locations` WHERE `locations`.`space_id` = 1 LIMIT 1
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
---
            def spaces
                @location = Space.find(params[:id]).location

SELECT  `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
---
            def show
                @location = Location.find(params[:id])

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
---
            def create
                @space = Space.find(params[:space][:id])