app/controllers/api/v1/photos_controller.rb

            def index
                @photos = Photo.all
---
SELECT `photos`.* FROM `photos`

            def show
                @photo = Photo.find(params[:id])
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1

            def create
                @space = Space.find(params[:space][:id])

                @photo = Photo.new(
                    space_id: @space.id,
                    photo_url: params[:photo_url]
                    )
                if @photo.save
---
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
INSERT INTO `photos` (`space_id`, `photo_url`, `created_at`, `updated_at`) VALUES (1, 'https://d500.epimg.net/cincodias/imagenes/2018/11/13/lifestyle/1542113135_776401_1542116070_noticia_normal.jpg', '2019-09-27 04:28:45', '2019-09-27 04:28:45')

            def spaces
                @allPhotos = Photo.all
                @photos = Array.new
                @allPhotos.each do |photo|
                    if photo.space.id == Space.find(params[:id]).id
---
SELECT `photos`.* FROM `photos`
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1