app/controllers/api/v1/spaces_controller.rb

SELECT `spaces`.* FROM `spaces`
---
      def index
        @spaces = Space.all

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
---
      def lessors
        @spaces = Lessor.find(params[:id]).spaces

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 13 LIMIT 1
UPDATE `spaces` SET `status` = 1, `updated_at` = '2019-11-18 02:16:46' WHERE `spaces`.`id` = 13
---
      def block
        @space = Space.find(params[:id])
        if @space.update(
          status: 1
          )

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 13 LIMIT 1
UPDATE `spaces` SET `status` = 0, `updated_at` = '2019-11-18 02:19:05' WHERE `spaces`.`id` = 13
---
      def unblock
        @space = Space.find(params[:id])
        if @space.update(
          status: 0
          )

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`space_id` = 1 ORDER BY `photos`.`id` ASC LIMIT 1
---
      def first_photo
        @space = Space.find(params[:id])
        render json: @space.photos.first, status: :ok

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
SELECT  `locations`.* FROM `locations` WHERE `locations`.`space_id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`space_id` = 1 ORDER BY `photos`.`id` ASC LIMIT 1
---
      def info
        @space = Space.find(params[:id])
        @location = @space.location

        @spaceInfo = SpaceInfo.new(
          id: @space.id,
          status: @space.status,
          rent_price: @space.rent_price,
          space_type: @space.space_type,
          description: @space.description,
          title: @space.title,
          address: @location.address,
          first_photo: @space.photos.first.photo_url
        )

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`space_id` = 1 ORDER BY `photos`.`id` ASC LIMIT 1
SELECT  `locations`.* FROM `locations` WHERE `locations`.`space_id` = 1 LIMIT 1
---
      def info_lessors
        @spaces = Lessor.find(params[:id]).spaces.order(id: :desc)
        @spacesInfo = Array.new

        @spaces.each do |space|
          @space = Space.find(space.id)

          @spaceInfo = SpaceInfo.new(
            id: @space.id,
            status: @space.status,
            rent_price: @space.rent_price,
            space_type: @space.space_type,
            description: @space.description,
            title: @space.title,
            address: @space.location.address,
            first_photo: @space.photos.first.photo_url
          )

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 0 LIMIT 1
---
      def show
        @space = Space.find(params[:id])

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
INSERT INTO `spaces` (`lessor_id`, `status`, `width`, `height`, `area`, `created_at`, `updated_at`, `rent_price`) VALUES (1, 0, 10, 20, 200, '2019-09-16 22:39:08', '2019-09-16 22:39:08', 100)
---
      def create
        @lessor = Lessor.find(params[:lessor][:id])

        @space = Space.new(
          lessor_id: @lessor.id,
          status: params[:status],
          width: params[:width],
          height: params[:height],
          area: params[:area],
          rent_price: params[:rent_price],
          space_type: params[:space_type],
          description: params[:description]
          )
        if @space.save

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 2 LIMIT 1
UPDATE `spaces` SET `rent_price` = 200, `space_type` = 1, `updated_at` = '2019-10-17 04:28:50' WHERE `spaces`.`id` = 1
---
      def update
        @lessor = Lessor.find(params[:lessor][:id])
        @space = Space.find(params[:id])
        if @space.update(
          lessor_id: @lessor.id,
          status: params[:status],
          width: params[:width],
          height: params[:height],
          area: params[:area],
          rent_price: params[:rent_price],
          space_type: params[:space_type],
          description: params[:description]
          )

SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 4 LIMIT 1
DELETE FROM `spaces` WHERE `spaces`.`id` = 2
---
      def destroy
        @space = Space.find(params[:id])
        if @space.destroy

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
INSERT INTO `spaces` (`lessor_id`, `status`, `width`, `height`, `area`, `created_at`, `updated_at`, `rent_price`, `space_type`, `description`, `title`) VALUES (1, 0, 10, 10, 100, '2019-10-07 23:15:34', '2019-10-07 23:15:34', 400, 1, 'descripción', 'título')
INSERT INTO `locations` (`space_id`, `address`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES (4, 'Av. Hola', -12, 10, '2019-10-07 23:15:34', '2019-10-07 23:15:34')
INSERT INTO `space_service_details` (`space_id`, `service_id`, `created_at`, `updated_at`) VALUES (8, 1, '2019-10-07 23:33:39', '2019-10-07 23:33:39')
SELECT  `photos`.* FROM `photos` WHERE `photos`.`space_id` = 1 ORDER BY `photos`.`id` ASC LIMIT 1
---
      def create_complete
        @lessor = Lessor.find(params[:lessor][:id])

        @space = Space.new(
          lessor_id: @lessor.id,
          status: 0,
          width: params[:width],
          height: params[:height],
          area: params[:area],
          rent_price: params[:rent_price],
          space_type: params[:space_type],
          description: params[:description],
          title: params[:title]
          )
        if @space.save
          @location = Location.new(
            space_id: @space.id,
            address: params[:location][:address],
            latitude: params[:location][:latitude],
            longitude: params[:location][:longitude]
          )
          if @location.save
            @servicesFromSpace = Array.new(params[:services])
            @servicesFromSpace.each do |serviceFromSpace|
              @serviceSpaceDetail = SpaceServiceDetail.new(
                space_id: @space.id,
                service_id: serviceFromSpace[:id]
              )
              if @serviceSpaceDetail.save
              end
            end
            @photosFromSpace = Array.new(params[:photos])
            @photosFromSpace.each do |photoFromSpace|

INSERT INTO `photos` (`space_id`, `photo_url`, `created_at`, `updated_at`) VALUES (13, 'www.url1.com', '2019-10-08 00:39:02', '2019-10-08 00:39:02')
---
                space_id: @space.id,
                photo_url: photoFromSpace[:photo_url]
              )
              if @photo.save

SELECT `spaces`.* FROM `spaces` ORDER BY `spaces`.`id` DESC
SELECT  `spaces`.* FROM `spaces` WHERE `spaces`.`id` = 1 LIMIT 1
SELECT  `locations`.* FROM `locations` WHERE `locations`.`space_id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`space_id` = 1 ORDER BY `photos`.`id` ASC LIMIT 1
SELECT  `services`.* FROM `services` INNER JOIN `space_service_details` ON `services`.`id` = `space_service_details`.`service_id` WHERE `space_service_details`.`space_id` = 8 LIMIT 11
---
      def info_around
        @spaces = Space.all.order(id: :desc).where(status: 0)
        @spacesInfo = Array.new

        @longitudeLessee = params[:longitude]
        @latitudeLessee = params[:latitude]

        @spaces.each do |space|
          @space = Space.find(space.id)

          if isAround(@longitudeLessee, @latitudeLessee, @space.location.longitude, @space.location.latitude)
            @spaceInfo = SpaceInfoAround.new(
              id: @space.id,
              status: @space.status,
              rent_price: @space.rent_price,
              space_type: @space.space_type,
              description: @space.description,
              title: @space.title,
              address: @space.location.address,
              first_photo: @space.photos.first.photo_url,
              height: @space.height,
              width: @space.width,
              area: @space.area,
              services: @space.services
            )