app/controllers/api/v1/spaces_controller.rb

SELECT  `photos`.* FROM `photos` WHERE `photos`.`space_id` = 1 ORDER BY `photos`.`id` ASC LIMIT 1
---
      def first_photo
        @space = Space.find(params[:id])
        render json: @space.photos.first, status: :ok

SELECT  `locations`.* FROM `locations` WHERE `locations`.`space_id` = 1 LIMIT 1
---
      def info
        @space = Space.find(params[:id])
        @location = @space.location

        @spaceInfo = SpaceInfo.new(
          id: @space.id,
          status: @space.status,
          rent_price: @space.rent_price,
          space_type: @space.space_type,
          description: @space.description,
          title: @space.title,
          address: @location.address,
          first_photo: @space.photos.first.photo_url
        )

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1
SELECT `spaces`.* FROM `spaces` WHERE `spaces`.`lessor_id` = 1 ORDER BY `spaces`.`created_at` DESC
---
      def info_lessors
        @spaces = Lessor.find(params[:id]).spaces
        @spacesInfo = Array.new

        @spaces.each do |space|

SELECT  `lessors`.* FROM `lessors` WHERE `lessors`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
      def create_complete
        @lessor = Lessor.find(params[:lessor][:id])