app/controllers/api/v1/space_service_details_controller.rb

SELECT `space_service_details`.* FROM `space_service_details`
---
            def index
                @space_service_details = SpaceServiceDetail.all