app/controllers/api/v1/spaces_controller.rb

INSERT INTO `spaces` (`lessor_id`, `status`, `width`, `height`, `area`, `created_at`, `updated_at`, `rent_price`) VALUES (1, 0, 10, 20, 200, '2019-09-16 22:39:08', '2019-09-16 22:39:08', 100)
---
      def create
        @lessor = Lessor.find(params[:lessor][:id])

        @space = Space.new(lessor_id: @lessor.id, status: params[:status], width: params[:width], height: params[:height], area: params[:area], rent_price: params[:rent_price])
        if @space.save